<template>
  <header class="bg-base-100 sticky  inset-x-0 top-0 z-50">
    <nav class="flex items-center justify-between p-6 lg:px-8" aria-label="Global">
      <div class="flex lg:flex-1">
        <a href="/" class="-m-1.5 p-1.5">
          <span class="sr-only"> 软件开发与系统集成工作室</span>
          <svg t="1705548802165" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
            p-id="29540" width="24" height="24">
            <path
              d="M884.363636 0a139.636364 139.636364 0 0 1 139.636364 139.636364v744.727272a139.636364 139.636364 0 0 1-139.636364 139.636364H139.636364a139.636364 139.636364 0 0 1-139.636364-139.636364V139.636364a139.636364 139.636364 0 0 1 139.636364-139.636364h744.727272z m0 23.272727H139.636364a116.363636 116.363636 0 0 0-116.247273 111.313455L23.272727 139.636364v472.855272A139.496727 139.496727 0 0 0 139.636364 674.909091h744.727272a139.496727 139.496727 0 0 0 116.363637-62.440727V139.636364a116.363636 116.363636 0 0 0-111.313455-116.247273L884.363636 23.272727z"
              fill="#FFE0B3" p-id="29541"></path>
            <path
              d="M333.800727 774.656a14.126545 14.126545 0 0 0 10.170182-3.956364 13.032727 13.032727 0 0 0 4.142546-9.774545 13.358545 13.358545 0 0 0-4.096-10.007273 14.08 14.08 0 0 0-10.24-3.979636 13.614545 13.614545 0 0 0-13.963637 13.963636c0 3.793455 1.326545 7.028364 3.979637 9.728a13.451636 13.451636 0 0 0 10.007272 4.026182z m-37.725091 215.458909c15.522909 0 27.508364-5.585455 35.956364-16.756364s12.683636-26.949818 12.683636-47.336727V805.236364h-22.295272v124.090181c0 28.090182-8.820364 42.146909-26.461091 42.14691-5.306182 0-10.914909-1.815273-16.826182-5.445819v20.107637c5.538909 2.653091 11.170909 3.956364 16.942545 3.956363z m119.086546-56.250182c16.965818 0 29.789091-7.447273 38.516363-22.388363h0.581819V930.909091h22.039272v-80.919273c0-31.813818-15.150545-47.709091-45.451636-47.709091-16.360727 0-30.813091 3.886545-43.287273 11.706182v21.457455c12.404364-10.146909 26.158545-15.220364 41.239273-15.220364 16.965818 0 25.460364 10.263273 25.460364 30.789818l-37.282909 5.236364c-27.810909 3.863273-41.704727 17.547636-41.704728 41.029818 0 11.194182 3.607273 20.107636 10.798546 26.693818 7.214545 6.586182 16.896 9.890909 29.090909 9.890909z m5.678545-18.059636c-6.981818 0-12.567273-1.908364-16.826182-5.701818a18.757818 18.757818 0 0 1-6.353454-14.661818c0-6.795636 1.954909-12.101818 5.841454-15.895273 3.909818-3.793455 11.008-6.353455 21.317819-7.726546l29.44-3.979636v12.055273c0 10.286545-3.165091 18.850909-9.448728 25.669818a31.185455 31.185455 0 0 1-23.970909 10.24z m143.872 15.104l49.757091-125.672727h-23.412363l-32.139637 90.228363a82.176 82.176 0 0 0-3.979636 17.594182h-0.581818a80.104727 80.104727 0 0 0-4.421819-18.059636L519.261091 805.236364h-24.32l47.243636 125.672727h22.528z m101.236364 2.955636c16.989091 0 29.812364-7.447273 38.539636-22.388363h0.558546V930.909091h22.039272v-80.919273c0-31.813818-15.127273-47.709091-45.451636-47.709091-16.360727 0-30.789818 3.886545-43.287273 11.706182v21.457455c12.427636-10.146909 26.158545-15.220364 41.239273-15.220364 16.989091 0 25.460364 10.263273 25.460364 30.789818l-37.282909 5.236364c-27.787636 3.863273-41.704727 17.547636-41.704728 41.029818 0 11.194182 3.607273 20.107636 10.798546 26.693818 7.214545 6.586182 16.896 9.890909 29.090909 9.890909z m5.678545-18.059636c-6.981818 0-12.567273-1.908364-16.802909-5.701818a18.757818 18.757818 0 0 1-6.376727-14.661818c0-6.795636 1.954909-12.101818 5.864727-15.895273 3.886545-3.793455 11.008-6.353455 21.294546-7.726546l29.44-3.979636v12.055273c0 10.286545-3.141818 18.850909-9.425455 25.669818a31.185455 31.185455 0 0 1-23.970909 10.24z"
              fill="#E58900" p-id="29542"></path>
            <path
              d="M529.850182 326.632727c24.064 26.624-6.656 51.712-6.656 51.712s59.904-30.72 32.768-69.632c-25.6-35.84-45.568-53.76 61.44-116.224 0 0.512-167.936 43.008-87.552 134.144"
              fill="#FF0000" p-id="29543"></path>
            <path
              d="M555.985455 93.160727s50.664727 50.688-48.151273 129.024c-78.848 62.976-17.92 98.816 0 140.288-46.592-41.984-79.872-78.848-57.344-113.152 32.256-50.688 125.952-75.264 105.472-156.16"
              fill="#FF0000" p-id="29544"></path>
            <path
              d="M611.258182 469.480727c91.648-47.616 49.152-94.208 19.968-87.552-7.68 1.536-10.752 2.56-10.752 2.56s2.56-4.096 8.192-5.632c58.88-20.48 103.936 60.416-18.944 93.184-0.512 0 1.024-1.536 1.536-2.56m-168.96 19.456s-18.944 10.752 13.312 14.848c38.4 4.096 58.88 4.096 101.376-4.096 0 0 11.776 7.68 26.624 13.312-95.744 40.448-216.576-2.56-141.312-24.064M430.545455 435.665455s-21.504 15.872 11.776 18.944c41.472 4.096 74.752 5.12 130.56-6.656 0 0 8.192 8.192 20.48 12.288-115.712 34.304-245.248 2.56-162.816-24.576"
              fill="#6699FF" p-id="29545"></path>
            <path
              d="M656.314182 528.872727s13.824 11.776-15.872 20.48c-55.808 17.408-230.4 22.528-279.04 1.024-17.408-7.68 15.872-17.92 25.6-20.48 10.752-2.56 17.408-1.536 17.408-1.536-19.456-14.336-125.952 26.112-53.76 37.888 195.072 31.232 356.352-14.336 305.664-37.376m-205.312-148.992s-89.088 21.504-31.744 28.16c24.576 3.072 73.216 2.56 117.76-1.536 36.864-3.072 73.728-9.728 73.728-9.728s-13.312 5.632-22.528 12.288c-90.624 24.064-265.216 13.312-215.04-11.776 44.032-19.968 77.824-17.408 77.824-17.408"
              fill="#6699FF" p-id="29546"></path>
            <path
              d="M460.218182 598.504727c88.064 5.632 223.232-3.072 226.816-45.056 0 0-6.656 15.872-73.216 28.16-75.264 13.824-168.448 12.288-223.232 3.072 1.024 0.512 12.288 10.24 69.632 13.824"
              fill="#6699FF" p-id="29547"></path>
          </svg>
          <!--          <img class="h-8 w-auto" src="../assets/logo.png" alt=""/>-->
        </a>
      </div>
      <div class="flex lg:hidden">
        <button type="button" class="-m-2.5 inline-flex items-center justify-center rounded-md p-2.5 text-gray-700"
          @click="mobileMenuOpen = true">
          <span class="sr-only">Open main menu</span>
          <Bars3Icon class="h-6 w-6" aria-hidden="true" />
        </button>
      </div>
      <div class="hidden lg:flex lg:gap-x-12">
        <a v-for="item in navigation" :key="item.name" :href="item.href"
          class="text-sm font-semibold leading-6 text-gray-900  hover:text-indigo-600 ">{{ item.name }}</a>
      </div>

      <div class="hidden lg:flex lg:flex-1 lg:justify-end">
      
        <a v-if="!hasLogin" href="/login" class="text-sm font-semibold leading-6 text-gray-900"><span
            aria-hidden="true"></span>
        </a>
    
        <Menu as="div" class="relative ml-3" v-if="hasLogin">
          <div>
            <MenuButton
              class="flex max-w-xs items-center rounded-full bg-gray-800 text-sm focus:outline-none focus:ring-2 focus:ring-white focus:ring-offset-2 focus:ring-offset-gray-800">
              <span class="sr-only">Open user menu</span>
              <img class="h-8 w-8 rounded-full" :src="user.avatar" alt="" />
            </MenuButton>
          </div>
          <transition enter-active-class="transition ease-out duration-100"
            enter-from-class="transform opacity-0 scale-95" enter-to-class="transform opacity-100 scale-100"
            leave-active-class="transition ease-in duration-75" leave-from-class="transform opacity-100 scale-100"
            leave-to-class="transform opacity-0 scale-95">
            <MenuItems
              class="absolute right-0 z-10 mt-2 w-48 origin-top-right rounded-md bg-white py-1 shadow-lg ring-1 ring-black ring-opacity-5 focus:outline-none">
              <MenuItem v-for="item in userNavigation" :key="item.name" v-slot="{ active }">
              <a :href="item.href" @click="act(item.name)"
                :class="[active ? 'bg-gray-100' : '', 'block px-4 py-2 text-sm text-gray-700']">{{ item.name }}</a>
              </MenuItem>
            </MenuItems>
          </transition>
        </Menu>
      </div>
    </nav>

    <Dialog as="div" class="lg:hidden" @close="mobileMenuOpen = false" :open="mobileMenuOpen">
      <div class="fixed inset-0 z-50" />
      <DialogPanel
        class="fixed inset-y-0 right-0 z-50 w-full overflow-y-auto bg-white px-6 py-6 sm:max-w-sm sm:ring-1 sm:ring-gray-900/10">
        <div class="flex items-center justify-between">
          <a href="#" class="-m-1.5 p-1.5">
            <span class="sr-only">Your Company</span>
            <svg t="1705548802165" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
              p-id="29540" width="24" height="24">
              <path
                d="M884.363636 0a139.636364 139.636364 0 0 1 139.636364 139.636364v744.727272a139.636364 139.636364 0 0 1-139.636364 139.636364H139.636364a139.636364 139.636364 0 0 1-139.636364-139.636364V139.636364a139.636364 139.636364 0 0 1 139.636364-139.636364h744.727272z m0 23.272727H139.636364a116.363636 116.363636 0 0 0-116.247273 111.313455L23.272727 139.636364v472.855272A139.496727 139.496727 0 0 0 139.636364 674.909091h744.727272a139.496727 139.496727 0 0 0 116.363637-62.440727V139.636364a116.363636 116.363636 0 0 0-111.313455-116.247273L884.363636 23.272727z"
                fill="#FFE0B3" p-id="29541"></path>
              <path
                d="M333.800727 774.656a14.126545 14.126545 0 0 0 10.170182-3.956364 13.032727 13.032727 0 0 0 4.142546-9.774545 13.358545 13.358545 0 0 0-4.096-10.007273 14.08 14.08 0 0 0-10.24-3.979636 13.614545 13.614545 0 0 0-13.963637 13.963636c0 3.793455 1.326545 7.028364 3.979637 9.728a13.451636 13.451636 0 0 0 10.007272 4.026182z m-37.725091 215.458909c15.522909 0 27.508364-5.585455 35.956364-16.756364s12.683636-26.949818 12.683636-47.336727V805.236364h-22.295272v124.090181c0 28.090182-8.820364 42.146909-26.461091 42.14691-5.306182 0-10.914909-1.815273-16.826182-5.445819v20.107637c5.538909 2.653091 11.170909 3.956364 16.942545 3.956363z m119.086546-56.250182c16.965818 0 29.789091-7.447273 38.516363-22.388363h0.581819V930.909091h22.039272v-80.919273c0-31.813818-15.150545-47.709091-45.451636-47.709091-16.360727 0-30.813091 3.886545-43.287273 11.706182v21.457455c12.404364-10.146909 26.158545-15.220364 41.239273-15.220364 16.965818 0 25.460364 10.263273 25.460364 30.789818l-37.282909 5.236364c-27.810909 3.863273-41.704727 17.547636-41.704728 41.029818 0 11.194182 3.607273 20.107636 10.798546 26.693818 7.214545 6.586182 16.896 9.890909 29.090909 9.890909z m5.678545-18.059636c-6.981818 0-12.567273-1.908364-16.826182-5.701818a18.757818 18.757818 0 0 1-6.353454-14.661818c0-6.795636 1.954909-12.101818 5.841454-15.895273 3.909818-3.793455 11.008-6.353455 21.317819-7.726546l29.44-3.979636v12.055273c0 10.286545-3.165091 18.850909-9.448728 25.669818a31.185455 31.185455 0 0 1-23.970909 10.24z m143.872 15.104l49.757091-125.672727h-23.412363l-32.139637 90.228363a82.176 82.176 0 0 0-3.979636 17.594182h-0.581818a80.104727 80.104727 0 0 0-4.421819-18.059636L519.261091 805.236364h-24.32l47.243636 125.672727h22.528z m101.236364 2.955636c16.989091 0 29.812364-7.447273 38.539636-22.388363h0.558546V930.909091h22.039272v-80.919273c0-31.813818-15.127273-47.709091-45.451636-47.709091-16.360727 0-30.789818 3.886545-43.287273 11.706182v21.457455c12.427636-10.146909 26.158545-15.220364 41.239273-15.220364 16.989091 0 25.460364 10.263273 25.460364 30.789818l-37.282909 5.236364c-27.787636 3.863273-41.704727 17.547636-41.704728 41.029818 0 11.194182 3.607273 20.107636 10.798546 26.693818 7.214545 6.586182 16.896 9.890909 29.090909 9.890909z m5.678545-18.059636c-6.981818 0-12.567273-1.908364-16.802909-5.701818a18.757818 18.757818 0 0 1-6.376727-14.661818c0-6.795636 1.954909-12.101818 5.864727-15.895273 3.886545-3.793455 11.008-6.353455 21.294546-7.726546l29.44-3.979636v12.055273c0 10.286545-3.141818 18.850909-9.425455 25.669818a31.185455 31.185455 0 0 1-23.970909 10.24z"
                fill="#E58900" p-id="29542"></path>
              <path
                d="M529.850182 326.632727c24.064 26.624-6.656 51.712-6.656 51.712s59.904-30.72 32.768-69.632c-25.6-35.84-45.568-53.76 61.44-116.224 0 0.512-167.936 43.008-87.552 134.144"
                fill="#FF0000" p-id="29543"></path>
              <path
                d="M555.985455 93.160727s50.664727 50.688-48.151273 129.024c-78.848 62.976-17.92 98.816 0 140.288-46.592-41.984-79.872-78.848-57.344-113.152 32.256-50.688 125.952-75.264 105.472-156.16"
                fill="#FF0000" p-id="29544"></path>
              <path
                d="M611.258182 469.480727c91.648-47.616 49.152-94.208 19.968-87.552-7.68 1.536-10.752 2.56-10.752 2.56s2.56-4.096 8.192-5.632c58.88-20.48 103.936 60.416-18.944 93.184-0.512 0 1.024-1.536 1.536-2.56m-168.96 19.456s-18.944 10.752 13.312 14.848c38.4 4.096 58.88 4.096 101.376-4.096 0 0 11.776 7.68 26.624 13.312-95.744 40.448-216.576-2.56-141.312-24.064M430.545455 435.665455s-21.504 15.872 11.776 18.944c41.472 4.096 74.752 5.12 130.56-6.656 0 0 8.192 8.192 20.48 12.288-115.712 34.304-245.248 2.56-162.816-24.576"
                fill="#6699FF" p-id="29545"></path>
              <path
                d="M656.314182 528.872727s13.824 11.776-15.872 20.48c-55.808 17.408-230.4 22.528-279.04 1.024-17.408-7.68 15.872-17.92 25.6-20.48 10.752-2.56 17.408-1.536 17.408-1.536-19.456-14.336-125.952 26.112-53.76 37.888 195.072 31.232 356.352-14.336 305.664-37.376m-205.312-148.992s-89.088 21.504-31.744 28.16c24.576 3.072 73.216 2.56 117.76-1.536 36.864-3.072 73.728-9.728 73.728-9.728s-13.312 5.632-22.528 12.288c-90.624 24.064-265.216 13.312-215.04-11.776 44.032-19.968 77.824-17.408 77.824-17.408"
                fill="#6699FF" p-id="29546"></path>
              <path
                d="M460.218182 598.504727c88.064 5.632 223.232-3.072 226.816-45.056 0 0-6.656 15.872-73.216 28.16-75.264 13.824-168.448 12.288-223.232 3.072 1.024 0.512 12.288 10.24 69.632 13.824"
                fill="#6699FF" p-id="29547"></path>
            </svg>

            <!--            <img class="h-8 w-auto" src="../assets/logo.png" alt=""/>-->
          </a>
          <button type="button" class="-m-2.5 rounded-md p-2.5 text-gray-700" @click="mobileMenuOpen = false">
            <span class="sr-only">Close menu</span>
            <XMarkIcon class="h-6 w-6" aria-hidden="true" />
          </button>
        </div>
        <div class="mt-6 flow-root">
          <div class="-my-6 divide-y divide-gray-500/10">
            <div class="space-y-2 py-6 ">
              <a v-for="item in navigation" :key="item.name" :href="item.href"
                class="-mx-3 block rounded-lg py-2 px-3 text-base font-semibold leading-7 text-gray-900 hover:text-indigo-600  ">{{
                  item.name
                }}</a>
            </div>
            <!--            <div class="py-6">-->
            <a href="/login" v-if="!hasLogin"
              class="-mx-3 block rounded-lg py-2.5 px-3 text-base font-semibold leading-7 text-gray-900 hover:bg-gray-50">请先登录</a>
            <Menu as="div" class="relative ml-3" v-if="hasLogin">
              <div>
                <MenuButton
                  class="flex max-w-xs items-center rounded-full bg-gray-800 text-sm focus:outline-none focus:ring-2 focus:ring-white focus:ring-offset-2 focus:ring-offset-gray-800">
                  <span class="sr-only">Open user menu</span>
                  <img class="h-8 w-8 rounded-full" :src="user.avatar" alt="" />
                </MenuButton>
              </div>
              <transition enter-active-class="transition ease-out duration-100"
                enter-from-class="transform opacity-0 scale-95" enter-to-class="transform opacity-100 scale-100"
                leave-active-class="transition ease-in duration-75" leave-from-class="transform opacity-100 scale-100"
                leave-to-class="transform opacity-0 scale-95">
                <MenuItems
                  class="absolute right-0 z-10 mt-2 w-48 origin-top-right rounded-md bg-white py-1 shadow-lg ring-1 ring-black ring-opacity-5 focus:outline-none">
                  <MenuItem v-for="item in userNavigation" :key="item.name" v-slot="{ active }">
                  <a :class="[active ? 'bg-gray-100' : '', 'block px-4 py-2 text-sm text-gray-700']" :href="item.href"
                    @click="act(item.name)">{{ item.name }} </a>
                  </MenuItem>
                </MenuItems>
              </transition>
            </Menu>
          </div>
        </div>
      </DialogPanel>
    </Dialog>
  </header>

</template>
<script setup>
import { ref } from 'vue'
import { Dialog, DialogPanel } from '@headlessui/vue'
import { Menu, MenuButton, MenuItem, MenuItems } from '@headlessui/vue'
import { Bars3Icon, XMarkIcon } from '@heroicons/vue/24/outline'
const navigation = [
  { name: '首页', href: '/' },
  { name: '队伍组成', href: '/team' },
  { name: '新闻公告', href: '/news' },
  { name: '集训章程', href: '/rules' },
  { name: '关于我们', href: '/about' },
]
const mobileMenuOpen = ref(false)
const userNavigation = [
  { name: '个人中心', href: "/personalCenter" },
  { name: '发布动态', href: "/articleEdit" },
  { name: '内容管理', href: "/contentManagement" },
  { name: '退出登录', href: null },
]


</script>

<script>
import { ref } from "vue";

export default {
  setup(ref) {

  },


  data() {
    return {
      user: {
        username: '',
        avatar: ''
      },
      hasLogin: false
    }
  },
  methods: {
    //退出登录
    act(name) {
      console.log("@@" + name)
      if (name === "退出登录") {
        this.$message.success("退出成功")
        this.logout()
      }




    },
    logout() {
      console.log(localStorage.getItem("token"))
      const _this = this
      _this.$axios.get("http://localhost:8082/logout", {
        headers: {
          "authorization": localStorage.getItem("token")
        }
      }).then(res => {
        console.log(res.data)
        _this.$store.commit("REMOVE_INFO")
        _this.$router.push("/login")
      })
    },
  },
  created() {
    if (this.$store.getters.getUser) {
      console.log("@@@@@" + this.$store.getters.getUser.username);
      this.user.username = this.$store.getters.getUser.username
      this.user.avatar = this.$store.getters.getUser.avatar
      this.hasLogin = true
    }
  }
}
</script>

<style scoped></style>
